/*
 *  ΠΑΝΕΠΙΣΤΗΜΙΟ ΠΑΤΡΩΝ
 *  ΤΜΗΜΑ ΗΛΕΚΤΡΟΛΟΓΩΝ ΜΗΧΑΝΙΚΩΝ
 *  ΜΑΘΗΜΑ: ΑΡΧΕΣ ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΥ
 *
 *  Χειρισμός δυαδικών αρχείων που περιέχουν εγγραφές καταγραφής
 *  ελάχιστης και μέγιστης θερμοκρασίας σε ένα δίκτυο αισθητήρων
 *
 *  ΠΑΤΡΑ 10-5-2014
 *
 *
 *  Τα δεδομένα κάθε εγγραφής αποθηκεύονται σε δομή τύπου

typedef struct {
	unsigned short int sensID ;		// κωδικός αριθμός αισθητήρα
	short int minTmp ;				// ελάχιστη θερμοκρασία
	short int maxTmp ;				// μέγιστη θερμοκρασία
	unsigned int Time ;				// χρόνος λήψης
} SENSOR ;

 *
 *  Εχουν υλοποιηθεί οι εξής συναρτήσεις
 *
 *  initSensorFile:		Τοποθέτηση τυχαίων εγγραφών σε αρχείο
 *  appendSensorFile:	Προσθήκη νέων εγγραφών στο τέλος του αρχείου
 *  printSensorFile:	Εκτύπωση των μη διαγραφέντων εγγραφών του αρχείου
 *  printSensorMeasures:Εκτύπωση των εγγραφών συγκεκριμένου αισθητήρα
 *  deleteSensorRecords:Διαγραφή εγγραφών συγκεκριμένου αισθητήρα
 *
*/

#include <stdio.h>
#include <stdlib.h>

// Εγγραφή μέτρησης ελάχιστης (minTmp) και μέγιστης (maxTmp) θερμοκρασίας
// για τον αισθητήρα που έχει κωδικό αριθμό (sensID)
typedef struct {
	unsigned short int sensID ;		// κωδικός αριθμός αισθητήρα
	short int minTmp ;				// ελάχιστη θερμοκρασία
	short int maxTmp ;				// μέγιστη θερμοκρασία
	unsigned int Time ;				// χρόνος λήψης
} SENSOR ;

// sensor ID for the deleted records
#define DELETED_REC	65500

// ***********************************************************************
// Πρωτότυπα συναρτήσεων
// ***********************************************************************
int initSensorFile( char *filename, int num ) ;
int appendSensorFile( char *filename, int num ) ;
int printSensorFile( char *filename ) ;
int printSensorMeasures( char *filename, unsigned short int sID  ) ;
int deleteSensorRecords( char *filename, unsigned short int sID ) ;


/********************************************************************************
Δημιουργία του αρχείου filename το οποίο έχει num εγγραφές τύπου SENSOR
Το περιεχόμενο των εγγραφών είναι τυχαίο
Επιστρέφει 0 σε επιτυχία, αρνητικό νούμερο σε σφάλμα
*******************************************************************************/
int initSensorFile( char *filename, int num )
{
	SENSOR s1 ;
	FILE *fp ;
	int i ;

	// ανοίγω το αρχείο το όνομα του οποίου περιέχεται στην μεταβλητή filename για εγγραφή
	if ( ( fp=fopen( filename, "wb")) == NULL )
		return -1 ;

	for( i = 0 ; i < num ; i++ )
	{
		// τοποθετώ τυχαίο ακέραιο που βρίσκεται στο διάστημα [i,i+2] σαν μέτρηση χρόνου (s1.Time)
		s1.Time = i+rand()%3 ;
		// τοποθετώ τυχαίο ακέραιο που βρίσκεται στο διάστημα [0,1000) σαν κωδικό νούμερο αισθητήρα (s1.sensID)
		s1.sensID = rand()%1000 ;
		// τοποθετώ τυχαίο ακέραιο που βρίσκεται στο διάστημα [-50,50) σαν ελάχιστη θερμοκρασία (s1.minTmp)
		s1. minTmp = (rand()%100) - 50 ;
		// τοποθετώ τυχαίο ακέραιο που βρίσκεται στο διάστημα [-25,75) σαν μέγιστη θερμοκρασία (s1.maxTmp)
		// φροντίζοντας πάντα η θερμοκρασία αυτή να είναι μεγαλύτερη ή ίση της s1.minTmp
		while ( (s1. maxTmp = (rand()%100) - 25) < s1.minTmp ) ;
		// Το περιεχόμενο της μεταβλητής s1 αποθηκεύεται στο αρχείο fp
		if ( !fwrite( &s1, sizeof(SENSOR), 1, fp))
		{
			fclose(fp) ;
			return -2 ;
		}
	}
	// κλείνω το αρχείο fp
	fclose(fp) ;
	return 0 ;
}


/********************************************************************************
Ανοίγει το αρχείο filename στο οποίο προσθέτει στο τέλος του num εγγραφές τύπου SENSOR
Το περιεχόμενο των εγγραφών είναι τυχαίο
Επιστρέφει 0 σε επιτυχία, αρνητικό νούμερο σε σφάλμα
*******************************************************************************/
int appendSensorFile( char *filename, int num )
{
	SENSOR s1 ;
	FILE *fp ;
	int i ;

	// ανοίγω το αρχείο το όνομα του οποίου περιέχεται στην μεταβλητή filename για προσθήκη στο τέλος του αρχείου
	if ( ( fp=fopen( filename, "ab")) == NULL )
		return -1 ;

	for( i = 0 ; i < num ; i++ )
	{
		// τοποθετώ τυχαίο ακέραιο που βρίσκεται στο διάστημα [i,i+2] σαν μέτρηση χρόνου (s1.Time)
		s1.Time = i+rand()%3 ;
		// τοποθετώ τυχαίο ακέραιο που βρίσκεται στο διάστημα [0,1000) σαν κωδικό νούμερο αισθητήρα (s1.sensID)
		s1.sensID = rand()%1000 ;
		// τοποθετώ τυχαίο ακέραιο που βρίσκεται στο διάστημα [-50,50) σαν ελάχιστη θερμοκρασία (s1.minTmp)
		s1. minTmp = (rand()%100) - 50 ;
		// τοποθετώ τυχαίο ακέραιο που βρίσκεται στο διάστημα [-25,75) σαν μέγιστη θερμοκρασία (s1.maxTmp)
		// φροντίζοντας πάντα η θερμοκρασία αυτή να είναι μεγαλύτερη ή ίση της s1.minTmp
		while ( (s1. maxTmp = (rand()%100) - 25) < s1.minTmp ) ;
		// Το περιεχόμενο της μεταβλητής s1 αποθηκεύεται στο αρχείο fp
		if ( !fwrite( &s1, sizeof(SENSOR), 1, fp))
		{
			fclose(fp) ;
			return -2 ;
		}
	}
	// κλείνω το αρχείο fp
	fclose(fp) ;
	return 0 ;
}

/********************************************************************************
Ανοιγμα του αρχείου filename το οποίο έχει εγγραφές τύπου SENSOR για διάβασμα
και εκτύπωση του περιεχομένου των εγγραφών.
Επιστρέφει έναν ακέραιο, τον αριθμό των εγγραφών που τυπώθηκαν, αρνητικό νούμερο σε σφάλμα
*******************************************************************************/
int printSensorFile( char *filename )
{
	SENSOR s1 ;
	FILE *fp ;
	unsigned int i ;

	// ανοίγω το αρχείο για διάβασμα το όνομα του οποίου περιέχεται στην μεταβλητή filename
	if ( ( fp=fopen( filename, "rb")) == NULL )
		return -1 ;
	i = 0 ;
	// Το περιεχόμενο μιας εγγραφής μεταφέρεται στην μεταβλητή s1
	while ( fread( &s1, sizeof(SENSOR), 1, fp))
		// Το περιεχόμενο της μεταβλητής s1 τυπώνεται στην οθόνη του τερματικού, εκτός από την περίπτωση που η εγγραφή έχει διαγραφεί
		if ( DELETED_REC != s1.sensID)
			printf( "%7u %7hu %7u %7hd %7hd\n", ++i, s1.sensID,s1.Time,s1.minTmp,s1.maxTmp) ;
	fclose(fp) ;
	return i ;
}



/********************************************************************************
Ανοιγμα του αρχείου filename το οποίο έχει εγγραφές τύπου SENSOR και εκτύπωση
των μετρήσεων του αισθητήρα με τον κωδικό αριθμό sID.
Επιστρέφει έναν ακέραιο, τον αριθμό των εγγραφών που τυπώθηκαν στην οθόνη, αρνητικό νούμερο σε σφάλμα
*******************************************************************************/
int printSensorMeasures( char *filename, unsigned short int sID  )
{
	SENSOR s1 ;
	FILE *fp ;
	unsigned int i ;

	// ανοίγω το αρχείο για διάβασμα το όνομα του οποίου περιέχεται στην μεταβλητή filename
	if ( ( fp=fopen( filename, "rb")) == NULL )
		return -1 ;
	i = 0 ;
	printf( "\n\n\n" ) ;
	// Το περιεχόμενο μιας εγγραφής μεταφέρεται στην μεταβλητή s1
	while ( fread( &s1, sizeof(SENSOR), 1, fp))
		// Το περιεχόμενο της μεταβλητής s1 τυπώνεται στην οθόνη του τερματικού όταν έχει κωδικό
		// αριθμό αισθητήρα s1.sensID ίδιο με τον επιθυμητό sID
		if ( s1.sensID == sID )
			printf( "%7u %7hu %7u %7hd %7hd\n", ++i, s1.sensID,s1.Time,s1.minTmp,s1.maxTmp) ;
	fclose(fp) ;
	return i ;
}


/********************************************************************************
Ανοιγμα του αρχείου filename το οποίο έχει εγγραφές τύπου SENSOR για διάβασμα/γράψιμο
Διαγράφει τις εγγραφές του αισθητήρα που έχουν κωδικό αριθμό sID. Η διαγραφή πραγματοποιείται με την
αλλαγή του κωδικού αριθμού του αισθητήρα σε 65535
Επιστρέφει έναν ακέραιο, τον αριθμό των εγγραφών που διαγράφηκαν, αρνητικό νούμερο σε σφάλμα
*******************************************************************************/
int deleteSensorRecords( char *filename, unsigned short int sID )
{
	SENSOR s1 ;
	FILE *fp ;
	unsigned int i ;

	// ανοίγω το αρχείο για διάβασμα το όνομα του οποίου περιέχεται στην μεταβλητή filename
	if ( ( fp=fopen( filename, "r+b")) == NULL )
		return -1 ;
	i = 0 ;
	// Το περιεχόμενο μιας εγγραφής μεταφέρεται στην μεταβλητή s1
	while ( fread( &s1, sizeof(SENSOR), 1, fp))
		// Αν ο κωδικός αριθμός του αισθητήρα είναι ίδιος με τον επιθυμητό
		if ( s1.sensID == sID )
		{
			// ξαναγυρνάμε μια εγγραφή πίσω
			fseek( fp, -sizeof(SENSOR), SEEK_CUR ) ;
			// αλλάζουμε τον κωδικό αριθμό του αισθητήρα στον αριθμό που θεωρεί ότι η εγγραφή έχει διαγραφεί
			s1.sensID = DELETED_REC ;
			// γράφουμε τα ίδια δεδομένα στην ίδια θέση με αλλαγμένο μόνο το s1.sensID
			fwrite( &s1, sizeof(SENSOR), 1, fp) ;
			i++ ;
		}
	fclose(fp) ;
	return i ;
}






// *******************************************************************************
int main(void)
{

	// δημιουργείται το αρχείο sensor.dat το οποίο έχει 100 εγγραφές
	if ( initSensorFile( "sensor.dat", 100 ) == 0 )
	{
		// τυπώνει τις εγγραφές του αρχείου και το πλήθος τους
		printf( "\n\nTotal number of Records: %d\n", printSensorFile( "sensor.dat" ) ) ;

		// τυπώνει τις εγγραφές του αισθητήρα με αριθμό 33
		printf( "\n\nTotal number of Records for sensor %d: %d\n", 33, printSensorMeasures( "sensor.dat", (unsigned short int)33 ) ) ;

		// προσθέτει 10 εγγραφές στο τέλος του αρχείου sensor.dat
		appendSensorFile( "sensor.dat", 10 ) ;

		// τυπώνει τις εγγραφές του αρχείου και το πλήθος τους
		printf( "\n\nTotal number of Records: %d\n", printSensorFile( "sensor.dat" ) ) ;

		// τυπώνει τις εγγραφές του αισθητήρα με αριθμό 33
		printf( "\n\nTotal number of Records for sensor %d: %d\n", 33, printSensorMeasures( "sensor.dat", (unsigned short int)33 ) ) ;

		printf( "Sensor %d records deleted: %d\n", 33, deleteSensorRecords( "sensor.dat", (unsigned short int)33 ) ) ;

		// τυπώνει τις εγγραφές του αρχείου και το πλήθος τους
		printf( "\n\nTotal number of Records: %d\n", printSensorFile( "sensor.dat" ) ) ;

		// τυπώνει τις εγγραφές του αισθητήρα με αριθμό 33
		printf( "\n\nTotal number of Records for sensor %d: %d\n", 33, printSensorMeasures( "sensor.dat", (unsigned short int)33 ) ) ;

	}

	return EXIT_SUCCESS;
}
